## [중복 데이터 처리]  
- 중복 데이터 기준 ==> 행(row)
- 행 단위로 모든 컬럼의 값이 완전히 똑같은 데이터는 중복 데이터
- 처리 => 제거

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비 <hr>

In [2]:
file='../DATA/employees.csv'

(3) 데이터 저장 : CSV => DF <hr>

In [3]:
empDF=pd.read_csv(file)

(4) 데이터 확인 <hr>

In [4]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

(5) 데이터 전처리 => 나.중복 데이터 처리 <hr>

- 중복 데이터 체크 => duplicated(): 중복이면 True
- 중복 데이터 처리 => drop_duplicated(): 삭제

In [8]:
# 행 단위로 완전히 똑같은 행 검사 ==> 0개
empDF.duplicated().sum()

0

In [9]:
# Team 컬럼
empDF.Team.duplicated().sum()

990

In [10]:
empDF.Team.nunique()

10

In [12]:
empDF["Mgmt"].astype(bool)

0        True
1        True
2       False
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000     True
Name: Mgmt, Length: 1001, dtype: bool

In [15]:
empDF["Mgmt"]=empDF["Mgmt"].astype(bool)

In [16]:
empDF.tail()

     First Name Gender Start Date    Salary   Mgmt          Team
996     Phillip   Male    1/31/84   42392.0  False       Finance
997     Russell   Male    5/20/13   96914.0  False       Product
998       Larry   Male    4/20/13   60500.0  False  Business Dev
999      Albert   Male    5/15/12  129949.0   True         Sales
1000        NaN    NaN        NaN       NaN   True           NaN

In [17]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), float64(1), object(4)
memory usage: 40.2+ KB

In [18]:
empDF["Salary"].fillna(0).tail()

996      42392.0
997      96914.0
998      60500.0
999     129949.0
1000         0.0
Name: Salary, dtype: float64

In [20]:
empDF["Salary"].fillna(0).astype(int).tail()

996      42392
997      96914
998      60500
999     129949
1000         0
Name: Salary, dtype: int32

In [21]:
empDF["Salary"]=empDF["Salary"].fillna(0).astype(int)

In [22]:
empDF["Salary"]

0            0
1        61933
2       130590
3       138705
4       101004
         ...
996      42392
997      96914
998      60500
999     129949
1000         0
Name: Salary, Length: 1001, dtype: int32

In [23]:
empDF.nunique()

First Name    200
Gender          2
Start Date    971
Salary        995
Mgmt            2
Team           10
dtype: int64

In [29]:
empDF["Gender"].astype("category")

0         Male
1         Male
2       Female
3          NaN
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000       NaN
Name: Gender, Length: 1001, dtype: category
Categories (2, object): ['Female', 'Male']

In [30]:
empDF["Gender"]=empDF["Gender"].astype("category")
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    object
 3   Salary      1001 non-null   int32
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), int32(1), object(2)
memory usage: 23.1+ KB

In [31]:
empDF["Team"]=empDF["Team"].astype("category")
empDF

     First Name  Gender Start Date  Salary   Mgmt          Team
0       Douglas    Male     8/6/93       0   True     Marketing
1        Thomas    Male    3/31/96   61933   True           NaN
2         Maria  Female        NaN  130590  False       Finance
3         Jerry     NaN     3/4/05  138705   True       Finance
4         Larry    Male    1/24/98  101004   True            IT
...         ...     ...        ...     ...    ...           ...
996     Phillip    Male    1/31/84   42392  False       Finance
997     Russell    Male    5/20/13   96914  False       Product
998       Larry    Male    4/20/13   60500  False  Business Dev
999      Albert    Male    5/15/12  129949   True         Sales
1000        NaN     NaN        NaN       0   True           NaN

[1001 rows x 6 columns]

In [32]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    object
 3   Salary      1001 non-null   int32
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), int32(1), object(2)
memory usage: 23.1+ KB